billing_cf/InformationRegisters/бестСостояниеЛСВЛК.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бестСостояниеЛСВЛК</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Подключен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

billing_cf/InformationRegisters/бестСостояниеЛСВЛК/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Функция ЛСПодключенКЛК(Дата,ЛС) Экспорт
	
	Подключен = Ложь;
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	бестСостояниеЛСВЛКСрезПоследних.Подключен КАК Подключен
		|ИЗ
		|	РегистрСведений.бестСостояниеЛСВЛК.СрезПоследних(&Дата, ЛицевойСчет = &ЛС) КАК бестСостояниеЛСВЛКСрезПоследних";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("ЛС"	, ЛС);
	
	РезультатЗапроса 	= Запрос.Выполнить();	
	Выборка 			= РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда 
		Подключен = Выборка.Подключен;
	КонецЕсли; 	
		
	Возврат Подключен;
	
КонецФункции

#КонецОбласти

#КонецЕсли
